#+TITLE: Daylight Saving Time
#+PROPERTY: header-args:js :eval no
#+OPTIONS: toc:nil
#+HTML_HEAD: <script src="../js/willett-time/clock.js" type="text/javascript"></script>

#+BEGIN_EXPORT html
<svg id="willet_clock2"
     class="svg-clock"
     width="481"
     height="565">
  <image xlink:href="../assets/willett-time/clock-face-blank-no-pendulum.png"
         width="100%"
         height="100%"
         id="bg-img"/>
    <g id="hands">
      <image xlink:href="../assets/willett-time/hour-hand.png" id="grandfather_hour_hand" class="hour_hand" x="404" y="240" width="14" height="34.45" />
      <image xlink:href="../assets/willett-time/minute-hand.png" id="grandfather_min_hand" class="min_hand" x="404" y="190" width="19" height="65" />
      <line id="grandfather_sec_hand" class="sec_hand" x1="405" y1="205" x2="405" y2="275"/>
    </g>
    <image xlink:href="../assets/willett-time/pendulum.png" id="pendulum" x="362" y="379" width="100" height="120" />
</svg>
<p id="grandfather_text">00:00:00</p>
#+END_EXPORT

This is a story about hubris and intervention in complex systems.

** How long could you power an NFL stadium with the energy from the extra fries sold at Hardee's following start of DST?

#+BEGIN_SRC python :results output :exports both
avg_sales_increase_dollars = 880 # http://commdocs.house.gov/committees/science/hsy73325.000/hsy73325_0.HTM#0
burger_combo_price_dollars = 7.09 # http://www.fastfoodmenuprices.com/hardees-carls-jr-prices/
num_locations = 5812 # https://en.wikipedia.org/wiki/Hardees
med_fry_grams = 132.0 # http://www.myfitnesspal.com/food/calories/369125865
kcal_per_fries = 410 # http://www.myfitnesspal.com/food/calories/369125865
avg_russet_grams = 155.0 # https://cooking.stackexchange.com/questions/10413/how-much-does-a-large-potato-weigh
nfl_stadium_mw = 10 # http://oilprice.com/Energy/Energy-General/How-Much-Energy-Does-the-Super-Bowl-Use.html

total_extra_fries_sold = (avg_sales_increase_dollars / burger_combo_price_dollars) * num_locations
total_extra_potatoes = total_extra_fries_sold * (med_fry_grams / avg_russet_grams)
total_extra_kcal = total_extra_fries_sold * kcal_per_fries
fry_mwh = total_extra_kcal / 859845.22785899
nfl_stadium_hours = fry_mwh / nfl_stadium_mw

print "Hardee's DST fries sold: {}".format(total_extra_fries_sold)
print "Potatoes required for Hardee's DST fries: {}".format(total_extra_potatoes)
print "Kilocalories from Hardee's DST fries: {}".format(total_extra_kcal)
print "Megawatt-hours from Hardee's DST fries: {}".format(fry_mwh)
print "Hours an NFL stadium could be powered by Hardee's DST fries: {}".format(nfl_stadium_hours)
#+END_SRC

#+RESULTS:
: Hardee's DST fries sold: 721376.586742
: Potatoes required for Hardee's DST fries: 614333.609354
: Kilocalories from Hardee's DST fries: 295764400.564
: Megawatt-hours from Hardee's DST fries: 343.973997856
: Hours an NFL stadium could be powered by Hardee's DST fries: 34.3973997856

